In [33]:
import os

os.makedirs(os.path.join('..', 'data'), exist_ok = True) #创建data目录
data_file = os.path.join('..', 'data', 'house_tiny.csv') #
with open(data_file, 'w') as f:
    f.write('NumRooms,Alley,Price\n')
    f.write('NA,Pave,127500\n')
    f.write('2,NA,106000\n')
    f.write('4,NA,178100\n')
    f.write('NA,NA,140000\n')

In [34]:
import pandas as pd
data = pd.read_csv(data_file)
data

   NumRooms Alley   Price
0       NaN  Pave  127500
1       2.0   NaN  106000
2       4.0   NaN  178100
3       NaN   NaN  140000

In [ ]:
inputs = data.iloc[:, 0:2]
outputs = data.iloc[:, 2]
inputs = inputs.fillna(inputs.mean())
inputs

C:\Users\93429\AppData\Local\Temp\ipykernel_49056\936284929.py:3: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  inputs = inputs.fillna(inputs.mean())

   NumRooms Alley
0       3.0  Pave
1       2.0   NaN
2       4.0   NaN
3       3.0   NaN

In [41]:
outputs

0    127500
1    106000
2    178100
3    140000
Name: Price, dtype: int64

In [ ]:
outputs.to_frame()

    Price
0  127500
1  106000
2  178100
3  140000

In [ ]:
inputs = pd.get_dummies(inputs, dummy_na=True)
inputs

   NumRooms  Alley_Pave  Alley_nan
0       3.0           1          0
1       2.0           0          1
2       4.0           0          1
3       3.0           0          1

In [ ]:
#将inputs和outputs转换成张量形式
import torch

x = torch.tensor(inputs.values)  #先转换成numpy数组,然后转换成pytorch张量
y = torch.tensor(outputs.values)
x, y

TypeError: can't convert np.ndarray of type numpy.object_. The only supported types are: float64, float32, float16, complex64, complex128, int64, int32, int16, int8, uint64, uint32, uint16, uint8, and bool.